#ifndef _DERIVATIVES_H
#define _DERIVATIVES_H


#include "vector_field.h"
#include "gfx.h"
// учитывая два изображения E1 и E2, где E2-кадр после E1, он вычисляет
// векторные поля Ex, Ey и Et, возвращающие его в структуру vector_field.

// производные оценивают изображение в момент времени между E1 и E2, в пикселях
// места на полпути между теми, что находятся в E1 и E2. Размеры x и y
// из возвращаемых векторных полей такие же, как E1 и E2, но последняя строка
// и последний столбец содержит бессмысленные значения.

// выделяет новую память для векторного поля. 
struct vector_field *compute_derivatives(struct image *e1, struct image *e2);

#endif
